examples/Toy12/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        physicalType    patch;
        nFaces          350;
        startFace       14800;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          50;
        startFace       15150;
    }
    defaultFaces
    {
        type            empty;
        nFaces          15000;
        startFace       15200;
    }
)

// ************************************************************************* //
