examples/Toy12/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         backward;
}

gradSchemes
{
    default         Gauss linear;
}


divSchemes
{
    default         none;

    div(alphaPhi.water,U.water)				Gauss limitedLinearV 1;
    div(((alpha.water*nuEff.water)*dev2(T(grad(U.water)))))	Gauss linear;
    div(phiGByA,cloud:alpha) 					Gauss limitedLinear 0.5;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

d2dt2Schemes
{
    default Euler;
}

// ************************************************************************* //
