examples/Toy12/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// ************************************************************************* //

solvers
{
    alpha.water
    {
	    solver          smoothSolver;
	    smoother        GaussSeidel;
	    tolerance       1e-6;
	    relTol          0.01;
	    max 	     0.9;
    }
    
    "cloud:alpha.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }
    
    /*"cloud:alphaFinal"
    {
        $alpha.water;
        rel 0;
    }*/
    
    p
    {
        solver          GAMG;
        tolerance       1e-6;
        relTol          0.1;               // <-- Loosen relative tolerance (10× faster)
        smoother        GaussSeidel;
        nPreSweeps      0;
        nPostSweeps     2;
        nFinestSweeps   2;
        cacheAgglomeration true;
        agglomerator    faceAreaPair;
        mergeLevels     1;
    }

    pFinal
    {
        $p;
        relTol          0;
    }
    
    "U.*"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-5;
        relTol          0.2;               // <-- Slightly looser relTol (converges faster)
        nSweeps         1;
    }

    "U.*Final"
    {
        $U;
        relTol          0;
    }

}

PIMPLE
{
    nOuterCorrectors     1;                // <-- Avoid outer loop unless necessary
    nCorrectors          1;                // <-- Reduce inner correctors (try 1)
    nNonOrthogonalCorrectors 0;
    momentumPredictor    yes;
    pRefCell             0;
    pRefValue            0;
}

